tap "homebrew/cask-fonts"
tap "take-takashi/face-mosaic"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Official Amazon AWS command-line interface
brew "awscli"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Create and run Linux containers using lightweight virtual machines
brew "container"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open source computer vision library
brew "opencv"
# Paste PNG into files
brew "pngpaste"
# Command-line tool for Stripe
brew "stripe-cli"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# 撮影動画にモザイク編集をかけるCLIツール
brew "take-takashi/face-mosaic/face-mosaic"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Image editing and design software
cask "affinity"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Voice and text chat software
cask "discord"
# Run Stable Diffusion locally
cask "draw-things"
cask "font-hackgen"
cask "font-hackgen-nerd"
# Audio player
cask "foobar2000"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
# Remote desktop application focusing on security
cask "vnc-viewer"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
mas "1Password for Safari", id: 1569813296
mas "Copilot", id: 6738511300
mas "DaVinci Resolve", id: 571213070
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Steam Link", id: 1246969117
mas "Surfingkeys", id: 1609752330
mas "Tampermonkey Classic", id: 1482490089
mas "Valheim", id: 1554294918
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
vscode "alefragnani.bookmarks"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gizak.shortcuts"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "google.geminicodeassist"
vscode "gruntfuggly.todo-tree"
vscode "hverlin.mise-vscode"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
